#+title: HHCRSP-SA lab-book
#+author: Henrique Silva
#+email: hcpsilva@inf.ufrgs.br
#+infojs_opt:
#+property: session *R*
#+property: cache yes
#+property: results graphics
#+property: exports both
#+property: tangle yes

Welcome to the project lab-book! This lab-book will be mainly dedicated to the
experiments that will be done in this project.

Having that said, we'll only have two primary experiments:

1. Math solver (testing max solver time and etc)
2. Simulated Annealing (testing temperature and such)

Both experiments will use the same test instances.

** Design

The random seed will be:

#+begin_src R :session :results value :exports results
floor(runif(1,1,99999))
#+end_src

#+RESULTS:
: 35182

Simple completely factorial design:

#+begin_src R :session :results output :exports both
suppressMessages(library(tidyverse))
suppressMessages(library(DoE.base))

ins = c("CPLEX_HCSRP_10_3",
        "CPLEX_HCSRP_25_9")
dummy = c(1, 2)

fac.design(nfactors=2,
           replications=5,
           repeat.only=FALSE,
           blocks=1,
           randomize=TRUE,
           seed=35182,
           factor.names=list(
             instance=ins,
             dummy=dummy)) %>%
  as_tibble %>%
  transmute(id=as.numeric(Blocks), instance) %>%
  distinct %>%
  write_delim("experiments/math.plan", delim=" ", col_names=FALSE)
#+end_src

#+RESULTS:
:
: creating full factorial with 4 runs ...

** Design

The random seed will be:

#+begin_src R :session :results value :exports results
floor(runif(1,1,99999))
#+end_src

#+RESULTS:
: 94627

Simple completely factorial design:

#+begin_src R :session :results output :exports both
suppressMessages(library(tidyverse))
suppressMessages(library(DoE.base))

ins = c("CPLEX_HCSRP_10_3", "CPLEX_HCSRP_25_3", "CPLEX_HCSRP_25_9")
temp = c(50, 100, 125, 150, 200)
fac = c(0.8, 0.85, 0.9)
strat = c(1, 2)
iter = c("50 10", "100 10", "150 20")

fac.design(nfactors=5,
           repeat.only=FALSE,
           blocks=1,
           randomize=TRUE,
           seed=94627,
           factor.names=list(
             instance=ins,
             temperature=temp,
             factor=fac,
             strategy=strat,
             iterations=iter)) %>%
  as_tibble %>%
  write_delim("experiments/sa.plan", delim=" ", col_names=FALSE)
#+end_src

#+RESULTS:
:
: creating full factorial with 270 runs ...

